In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
#handling missing data

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,
'avocado'])

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
....: [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=0, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
 df = pd.DataFrame(np.random.randn(7, 3))

In [21]:
df

          0         1         2
0 -0.352536 -0.860694 -0.955710
1 -1.053866 -0.744157  1.249474
2 -1.890469  0.716729 -1.319096
3  0.104216  0.936761 -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

In [22]:
df.iloc[:4, 1] = NA

In [23]:
df

          0         1         2
0 -0.352536       NaN -0.955710
1 -1.053866       NaN  1.249474
2 -1.890469       NaN -1.319096
3  0.104216       NaN -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0 -0.352536       NaN       NaN
1 -1.053866       NaN       NaN
2 -1.890469       NaN -1.319096
3  0.104216       NaN -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

In [26]:
df.dropna()

          0         1         2
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

In [27]:
df

          0         1         2
0 -0.352536       NaN       NaN
1 -1.053866       NaN       NaN
2 -1.890469       NaN -1.319096
3  0.104216       NaN -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

In [28]:
df.dropna(thresh=2)

          0         1         2
2 -1.890469       NaN -1.319096
3  0.104216       NaN -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

# Filling in missing data

In [29]:
df.fillna(0)

          0         1         2
0 -0.352536  0.000000  0.000000
1 -1.053866  0.000000  0.000000
2 -1.890469  0.000000 -1.319096
3  0.104216  0.000000 -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

### filling with dict

In [30]:
df.fillna({1:0.5, 2:0.2})

          0         1         2
0 -0.352536  0.500000  0.200000
1 -1.053866  0.500000  0.200000
2 -1.890469  0.500000 -1.319096
3  0.104216  0.500000 -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

In [31]:
df

          0         1         2
0 -0.352536       NaN       NaN
1 -1.053866       NaN       NaN
2 -1.890469       NaN -1.319096
3  0.104216       NaN -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

In [32]:
_ = df.fillna(0, inplace=True)

In [33]:
df

          0         1         2
0 -0.352536  0.000000  0.000000
1 -1.053866  0.000000  0.000000
2 -1.890469  0.000000 -1.319096
3  0.104216  0.000000 -0.561716
4 -0.826957 -0.889496  0.092489
5  0.279671 -0.109185 -0.076828
6  0.743023 -0.410484  0.020551

In [34]:
df = pd.DataFrame(np.random.randn(6, 3))

In [35]:
df

          0         1         2
0 -0.453244  0.506322  0.718930
1 -0.314153 -0.331529  0.886886
2  1.161775 -1.304160 -1.329413
3 -1.407317  1.050860  0.515608
4  0.134209 -0.487760 -0.885734
5 -1.562863  0.473460  0.628191

In [36]:
df.iloc[2:, 1] = NA

In [37]:
df

          0         1         2
0 -0.453244  0.506322  0.718930
1 -0.314153 -0.331529  0.886886
2  1.161775       NaN -1.329413
3 -1.407317       NaN  0.515608
4  0.134209       NaN -0.885734
5 -1.562863       NaN  0.628191

In [38]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.453244  0.506322  0.718930
1 -0.314153 -0.331529  0.886886
2  1.161775 -0.331529 -1.329413
3 -1.407317 -0.331529  0.515608
4  0.134209 -0.331529 -0.885734
5 -1.562863 -0.331529  0.628191

In [39]:
df

          0         1         2
0 -0.453244  0.506322  0.718930
1 -0.314153 -0.331529  0.886886
2  1.161775       NaN -1.329413
3 -1.407317       NaN  0.515608
4  0.134209       NaN -0.885734
5 -1.562863       NaN  0.628191

In [40]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.453244  0.506322  0.718930
1 -0.314153 -0.331529  0.886886
2  1.161775 -0.331529 -1.329413
3 -1.407317 -0.331529  0.515608
4  0.134209       NaN -0.885734
5 -1.562863       NaN  0.628191

In [41]:
 data = pd.Series([1., NA, 3.5, NA, 7])

In [42]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [43]:
data.mean()

3.8333333333333335

In [44]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [45]:
 data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [46]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [49]:
data['v1'] = range(7)

In [50]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [51]:
data.drop_duplicates(['v1'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [52]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [54]:
data.drop_duplicates(['k2', 'v1'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

### Transforming Data Using a Function or Mapping

In [55]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [56]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [58]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [59]:
lowercased = data['food'].str.lower()

In [60]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [61]:
data['animal'] = lowercased

In [62]:
data

          food  ounces       animal
0        bacon     4.0        bacon
1  pulled pork     3.0  pulled pork
2        bacon    12.0        bacon
3     Pastrami     6.0     pastrami
4  corned beef     7.5  corned beef
5        Bacon     8.0        bacon
6     pastrami     3.0     pastrami
7    honey ham     5.0    honey ham
8     nova lox     6.0     nova lox

In [63]:
data['animal'] = lowercased.map(meat_to_animal)

In [64]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [65]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [66]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [67]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [68]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [69]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [70]:
#implicit = True
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [71]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## renaming axis

In [72]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [73]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [74]:
transform = lambda x: x[:4].upper()

In [75]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [76]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [77]:
data.index = data.index.map(transform)

In [78]:
data.index

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [79]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [80]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Nevada', 'Queens', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [81]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Nevada      0    1      2     3
Queens      4    5      6     7
New York    8    9     10    11

In [82]:
data

          one  two  three  four
Nevada      0    1      2     3
Queens      4    5      6     7
New York    8    9     10    11

In [83]:
#can be used as dict

In [84]:
data.rename(index={'Nevada': 'NEV',
                  'Queens': 'QUE'},
           columns={'three': '3'})

          one  two   3  four
NEV         0    1   2     3
QUE         4    5   6     7
New York    8    9  10    11

In [85]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [86]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

# Binning

In [87]:
 bins = [18, 25, 35, 60, 100]

In [88]:
cats = pd.cut(ages, bins)

In [89]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [90]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [91]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [92]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [93]:
 group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [94]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [95]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [96]:
 data = np.random.rand(20)

In [97]:
cut_1 = pd.cut(data, 4)

In [98]:
cut_1

[(0.0525, 0.236], (0.602, 0.785], (0.0525, 0.236], (0.236, 0.419], (0.0525, 0.236], ..., (0.0525, 0.236], (0.419, 0.602], (0.419, 0.602], (0.0525, 0.236], (0.419, 0.602]]
Length: 20
Categories (4, interval[float64, right]): [(0.0525, 0.236] < (0.236, 0.419] < (0.419, 0.602] < (0.602, 0.785]]

In [99]:
cu = pd.cut(data, 4, precision=2)

In [100]:
cu

[(0.053, 0.24], (0.6, 0.78], (0.053, 0.24], (0.24, 0.42], (0.053, 0.24], ..., (0.053, 0.24], (0.42, 0.6], (0.42, 0.6], (0.053, 0.24], (0.42, 0.6]]
Length: 20
Categories (4, interval[float64, right]): [(0.053, 0.24] < (0.24, 0.42] < (0.42, 0.6] < (0.6, 0.78]]

In [101]:
data = np.random.randn(1000) # Normally distributed

In [102]:
data

array([ 7.04431244e-01, -1.50423310e+00, -1.34099985e+00,  9.53490663e-01,
       -8.76706402e-01, -4.08297230e-02, -3.36466915e-01, -8.23023658e-01,
       -8.31308798e-01,  1.30580910e+00, -5.09365902e-01, -1.75123974e+00,
       -1.38019496e+00,  1.22448087e-01,  1.58021821e+00,  4.79540018e-01,
        6.89719141e-02,  5.78461452e-01,  7.36720434e-01, -1.73765174e+00,
        9.43744888e-01,  2.40070100e-01,  5.97095700e-01,  1.99779299e+00,
        7.85705612e-01,  2.21404704e-01, -1.83301024e+00,  9.36388370e-01,
       -7.89765279e-01, -4.88080816e-01,  6.57906754e-01, -1.12029918e+00,
        1.20740258e+00, -7.87444900e-01, -1.23761837e+00,  1.41038384e-01,
        9.96700303e-01,  3.42583177e-02,  4.78301790e-01, -6.81125100e-02,
       -2.70729744e-01, -3.63244470e-01,  1.65470892e-01,  1.03572808e+00,
       -4.48937501e-01,  1.42713636e-01, -1.63057825e-01,  9.99732855e-01,
        1.13529029e+00, -5.10090797e-01, -2.49023436e+00,  1.15849612e-01,
       -1.89683514e+00, -2.27942996e-01, -6.13941428e-02, -5.88012790e-01,
       -7.04016040e-01, -1.81188367e+00,  1.04430323e+00, -1.40357734e+00,
        1.33494416e+00, -3.09122372e-02, -8.07030367e-01, -2.98891846e-01,
        1.15916593e+00, -3.33896361e-01, -9.75766453e-01, -9.68289774e-02,
       -8.65454492e-01, -6.91000916e-01,  2.36995876e-02, -1.01705767e+00,
       -1.73390435e+00,  6.65843561e-02,  5.49717120e-01, -1.51760018e-01,
       -9.64040760e-01,  5.47110676e-01,  9.40876736e-01, -1.54760097e+00,
        5.94188583e-01, -5.68212970e-01, -3.51573034e-01, -4.62779851e-02,
        1.09833695e+00,  3.72022518e-01,  1.34975187e+00, -7.82474577e-02,
       -5.88914532e-01,  1.08492045e+00, -1.80411425e+00, -9.11829959e-02,
       -2.45483944e-01,  1.33254551e+00,  9.33895317e-01,  2.16393608e-01,
       -9.53511187e-01, -1.64205268e+00, -4.17359626e-01, -1.54807839e+00,
       -1.06232299e+00,  1.73669464e+00, -5.73305741e-02, -3.82503388e-03,
       -2.47594606e-01, -1.98328036e+00, -8.69294914e-02, -8.94710442e-01,
        2.69296401e-02, -3.28062838e-01, -1.24707712e+00,  7.04362137e-01,
       -1.68665716e+00, -6.08797327e-01,  1.85107963e-01,  9.96550852e-01,
       -8.61361510e-01, -2.03191742e+00, -1.23901963e-01, -1.41917193e+00,
        3.47134064e-01, -1.10969428e+00, -1.29834640e+00, -4.35372989e-01,
        1.02385870e+00, -3.30112230e-01,  1.42051805e+00,  1.72161626e-01,
        1.98844919e+00,  1.43265155e+00,  4.28947560e-01,  5.37553045e-01,
       -1.12455624e+00,  1.10551031e+00,  1.32461064e+00, -2.67778354e-01,
       -1.35057570e+00, -1.04864359e+00, -1.14999868e+00, -3.22386081e-01,
        1.26291487e+00, -2.78678070e+00,  1.00516606e+00, -3.42806902e-01,
       -5.33626004e-01, -3.90021373e-01, -7.37864037e-01, -1.36460200e+00,
       -5.16964921e-01, -2.32026896e-02,  4.42516015e-01, -1.21256144e+00,
        1.70931842e-01, -1.64518137e+00, -6.93519593e-01, -2.01502870e-01,
       -8.04236737e-01, -1.98274682e-01,  8.64423054e-01, -1.17109716e+00,
        9.63583462e-01,  1.44049249e+00, -3.54101511e-01,  3.05038392e-01,
       -7.45153142e-01,  2.24093024e-01,  1.11471796e+00, -1.13571060e-01,
       -8.41555439e-01, -1.29693803e+00,  4.01016929e-02,  8.68045517e-01,
        1.89616916e+00, -1.55428106e+00,  2.10872323e+00,  2.59935506e-01,
       -2.63236424e-01, -7.88785130e-02,  1.37899718e+00, -1.14204723e+00,
        1.03841416e-01, -1.69737428e+00,  6.29489231e-02, -1.38629026e+00,
       -3.00659228e-01,  1.44429446e+00,  1.35378219e+00, -1.06730655e+00,
        2.35625810e-01, -1.51973736e+00, -7.05958527e-01,  2.78290071e+00,
        3.18047411e+00,  2.57068884e-01, -8.18916552e-01,  1.31710042e+00,
        2.24538613e-01,  3.87027762e-01,  7.85566684e-01, -3.68521542e-01,
       -1.00276407e+00,  1.11552815e+00,  1.18853034e-01, -5.22874138e-02,
        1.40044592e+00,  6.49733102e-01, -1.45534422e+00,  8.49214863e-01,
       -4.16978951e-01,  1.79997136e+00, -2.32863612e+00,  1.13957633e+00,
        6.24240044e-01,  1.06432413e-01, -6.91799293e-01, -6.18492061e-01,
        8.74383764e-01, -6.67316672e-02, -4.08179705e-01, -2.44118079e-01,
       -1.08205430e-01,  5.24953791e-02,  2.19268325e+00, -1.60251027e+00,
       -8.81207339e-01, -3.59484205e-01,  7.88574292e-03,  1.61610620e+00,
       -1.65743516e+00,  4.12325298e-01, -4.26131627e-01, -4.61184602e-01,
        1.31373875e+00,  1.54512598e+00,  7.51348633e-01, -1.07482709e+00,
       -2.53983406e-01, -2.85633476e+00,  4.25034798e-01, -8.57367025e-01,
        2.15352946e-01,  1.77752294e+00,  1.67660354e+00,  2.01306212e+00,
        3.36789153e-01, -4.63118223e-01, -5.40221536e-01, -1.28410389e+00,
       -1.82562017e-02, -2.78181665e-01,  8.82564254e-01,  8.14729337e-01,
       -9.10739149e-01,  9.37830753e-01,  3.55158996e-02, -1.78750742e+00,
       -1.46493757e+00,  3.86410345e-01,  2.94405109e+00, -6.72293261e-01,
       -1.08592453e+00, -1.06098408e-01,  9.46740322e-01,  6.99988074e-01,
       -4.82742546e-02,  2.71273689e-01, -3.57087868e-01, -3.86887144e-01,
        7.95726777e-01,  5.50338206e-01,  2.87068806e-01, -9.26723982e-02,
       -5.90265961e-01, -1.90036549e+00, -1.15558962e+00,  1.62385489e+00,
       -5.69641205e-01,  1.31142630e+00, -1.19178674e+00,  1.47962530e-02,
        3.88195281e-01, -4.51948426e-02,  1.79425056e-01, -1.50023147e+00,
       -1.18621857e+00,  6.76662962e-01, -1.23942454e+00,  5.14299835e-01,
        8.11859482e-02,  1.31477496e+00,  5.02644696e-01, -1.51394234e+00,
       -3.67095968e-01,  1.66147450e+00, -1.12341271e+00, -5.18175211e-01,
       -2.32614573e-01,  7.56009304e-01, -6.02206129e-01,  2.15998686e-02,
       -9.78566616e-01,  2.01998479e-01,  9.25402225e-01,  2.48668460e-01,
       -3.80949570e-01,  3.94651743e-01, -2.70622017e-02, -1.06914559e+00,
        1.32994447e+00,  1.47676852e+00, -6.95915412e-01, -5.28262799e-01,
        1.39465164e+00, -4.89898512e-01,  3.87432278e+00, -1.65773087e-01,
       -1.18296087e+00, -1.84578385e-01,  3.32194928e-01, -1.67054974e+00,
        7.52994489e-01,  1.36924330e+00, -1.53323117e+00,  5.20984428e-01,
       -1.04005536e+00,  6.03810245e-01, -9.82773934e-01, -2.13564746e+00,
        6.22296564e-01, -8.98636106e-01,  4.75472290e-01, -3.80169902e-02,
       -1.99829833e+00, -1.78393804e+00,  9.22595385e-01,  7.37056637e-01,
       -9.22844382e-01,  1.44064442e+00, -9.59919558e-02,  8.52345949e-01,
        6.66586597e-01, -9.87580804e-01, -1.80824204e+00, -5.01226960e-01,
       -1.06983241e-02,  4.13819225e-01, -1.44620581e-01, -1.01536763e+00,
       -3.95457265e-01,  6.71345714e-01,  3.30444220e-01, -2.11571552e-02,
        7.28087709e-01, -4.50591996e-01,  1.14252303e+00, -4.46161282e-01,
        1.90336014e-02, -1.64050381e+00, -1.24612319e-01,  7.11393890e-01,
        4.42155475e-01,  2.53553648e-01,  1.41094602e+00,  4.91229579e-01,
        3.20519830e-01, -3.97150738e-01,  1.51653253e+00,  2.46330632e-01,
        3.61199406e-01, -7.91592148e-01, -1.72307578e+00, -1.08664412e-01,
        9.29877061e-02,  3.70909855e-01,  2.81943834e-01, -1.82074492e+00,
        4.59177801e-01, -1.98103408e+00, -1.15379806e+00,  3.35439376e-01,
        3.01740430e-01, -3.57354605e-01, -1.23183044e+00,  1.18904894e-01,
       -9.77016020e-01,  5.73951584e-01,  9.35039215e-01, -6.16498216e-01,
        4.12106212e-01,  7.66137792e-01,  2.06291948e-01,  7.50477453e-01,
       -1.73620355e+00, -1.23050160e+00, -6.05367162e-02,  2.56741395e-01,
        9.44262893e-01,  6.86602372e-01,  1.20890690e-01,  3.46474401e-01,
       -3.37444654e-02,  9.81736934e-02,  1.94259679e+00, -1.74020531e-01,
       -1.98793101e+00, -1.13523342e-01,  1.19602845e+00, -8.04947523e-01,
       -1.50767927e+00, -1.46892457e+00, -7.41860458e-01,  1.11346849e+00,
        2.41016668e-01,  5.25145500e-01, -1.64992998e+00,  3.29397393e-01,
        1.50750346e+00, -1.54741317e-01,  1.18839427e+00,  1.23496837e-01,
        2.93297631e-01,  1.12003360e+00,  6.30642343e-01,  5.74097079e-01,
        1.09991725e+00,  1.06951054e+00, -8.92418420e-01, -1.72819090e+00,
        9.13918261e-01,  5.83129056e-01, -4.20801626e-01,  3.10708438e-01,
        7.76847943e-01,  2.83895968e-01, -5.71716875e-01, -3.73655826e-01,
       -9.22134234e-03, -1.95027889e-01,  1.03313369e+00,  1.12068124e+00,
       -1.17654848e+00, -4.84485142e-01, -1.80566799e+00, -4.11826875e-01,
        8.11115033e-01,  6.02592724e-01,  3.58630163e-01,  1.03790013e-01,
        4.91424372e-01,  7.50561262e-01, -2.44383456e-01,  1.23511007e+00,
        3.21615576e-01, -2.29130862e+00,  6.41361451e-01, -4.98570240e-01,
        4.07282993e-01, -6.81479925e-02, -1.00963613e+00, -4.20847824e-02,
        1.22614111e+00, -1.08847656e+00,  3.90611672e-01,  1.07351134e+00,
        6.40236584e-01, -4.07893375e-01, -1.04746672e+00,  4.45987853e-02,
        1.76174624e+00,  1.46181692e+00,  3.96092514e-02,  7.14828459e-01,
       -4.92899104e-02, -8.68000501e-02,  4.21762167e-01, -5.98088132e-01,
        1.29610437e+00, -1.14970578e+00,  3.57345372e-01, -4.09350384e-01,
        2.09312262e+00, -1.00917026e+00, -3.13631934e-01, -7.12464671e-02,
       -8.02128137e-01,  1.74817897e-01,  5.34237021e-01,  1.22404264e+00,
       -2.24963685e-01,  5.97149784e-01,  1.47998976e+00, -1.91196999e+00,
       -1.81075727e-01, -2.42422724e-01, -6.90965026e-01, -5.68755255e-02,
        1.68375820e+00,  2.52168453e-01,  1.29156843e+00,  1.90636567e-01,
        1.39739248e+00,  6.84980920e-01, -5.78481465e-01,  1.70999041e+00,
        1.31991518e+00,  1.65199425e-01,  2.24827770e-01, -1.08053266e+00,
        1.59011025e+00, -1.66016782e+00, -5.49368286e-01, -7.58154424e-01,
       -3.64052066e-01, -4.60800464e-01, -5.32437290e-01,  1.81857213e+00,
        4.34688952e-01,  6.94043380e-01, -1.26042118e+00,  1.06107768e+00,
        3.83161785e-01,  5.95686175e-01,  2.20482262e-01,  9.33488063e-01,
       -1.24331860e-01, -2.92287650e-01, -8.59333996e-01, -9.65388970e-01,
       -7.98044126e-01,  1.08636868e-01, -4.50822108e-01, -8.51757966e-01,
        1.28313944e+00, -1.91849009e+00, -4.86967434e-01,  1.11498889e+00,
       -2.01286451e-01, -1.09816453e-01,  9.47201106e-01,  1.55187991e+00,
       -3.44094718e-02,  3.17448719e-01, -1.19931570e+00, -2.92827858e-01,
        1.48115770e+00, -1.65495583e-01, -2.66749780e-01, -1.30700944e+00,
        5.88962238e-01, -1.35175679e+00,  4.12774178e-01,  2.42062846e+00,
       -1.32996970e+00, -9.83856581e-01, -4.68641154e-01,  1.26402929e-01,
       -3.12618228e-01, -5.18350438e-01, -4.29430160e-01, -3.12336632e-01,
       -7.37251504e-02,  1.58922126e+00,  8.00196264e-02,  1.32881685e+00,
       -1.88528864e-01,  7.31664298e-01,  9.01041377e-01, -3.34510868e-01,
       -6.40241221e-01,  1.21473358e+00, -1.02761078e-01,  2.20884534e+00,
        3.39716365e-01,  4.27356333e-01, -2.70476192e-01, -4.87109131e-01,
        3.73165852e-01,  2.41332938e+00, -9.52623614e-01,  2.95469816e-01,
       -8.72876048e-01, -1.30161367e+00,  7.53338635e-01,  5.32711265e-01,
       -1.53781214e+00,  1.45242903e+00,  2.08083620e-02, -2.76716931e-01,
        9.99124672e-01,  3.94583504e-01,  1.27680571e+00,  1.91512412e-01,
        7.28597309e-01, -7.62502532e-03,  8.68119527e-01,  6.21402998e-01,
        3.18611142e-02, -1.77518265e-01, -2.72251147e-01, -1.08198044e+00,
       -2.68283715e+00,  9.68490792e-01,  3.46798237e-01, -1.41403661e+00,
        8.05454368e-01,  1.02128793e-01,  2.89150545e-01,  7.11395065e-01,
       -8.91974866e-01,  9.36453034e-01, -8.35711262e-02,  8.19472535e-01,
        5.73866908e-01, -3.31773140e-01,  7.36675994e-01,  1.02444163e+00,
       -1.23259818e+00, -9.31440168e-01,  3.33432797e-01,  1.16103936e+00,
       -3.14150217e-01, -6.56992543e-01,  2.75120349e-01,  1.15055028e+00,
        1.83605390e+00,  7.64190644e-01,  7.66480506e-02, -2.03754249e+00,
       -7.61931370e-01, -1.36646858e-01,  1.09914252e+00,  1.35405649e+00,
        1.40516574e+00,  2.38653734e+00, -4.32650832e-02,  2.86304667e-02,
       -7.30617711e-01,  9.63394468e-01,  5.55266723e-01, -1.00911181e-01,
       -5.73588485e-01,  7.16961486e-02,  1.00711450e-01, -8.98736025e-01,
        5.46901268e-01, -1.03869334e+00,  1.93346286e-01, -1.20443606e+00,
        4.49799509e-01, -3.66981243e-01,  5.15195814e-02,  6.26227032e-01,
       -1.36932962e-01, -5.25104898e-01, -1.89100598e+00, -1.85432389e-01,
       -1.85877556e+00,  7.73607649e-01, -1.59172768e+00, -6.09794689e-01,
        1.01339808e+00, -2.42850142e-02, -1.90489951e-01, -2.54318713e+00,
        3.09686118e-01, -6.13987016e-01, -9.80179965e-01,  3.29437776e-01,
       -1.51690761e+00, -1.55033486e+00,  1.42530476e+00,  6.45985620e-01,
        1.29701120e+00,  1.45121522e+00,  7.51751727e-01, -2.51840658e+00,
       -9.24743218e-01,  1.10656467e+00, -6.40853780e-02, -7.85413166e-01,
        6.44925775e-01, -2.11413394e-01,  4.49506746e-01, -2.25393510e-01,
        1.29023164e+00, -1.33175191e+00,  1.81182461e+00, -3.49941158e-01,
        8.55702513e-01,  7.12621756e-01, -6.71629786e-01,  1.43168418e-01,
       -4.36038504e-01,  4.87162315e-01,  6.58508443e-01,  4.28841807e-01,
       -1.10513435e+00, -1.66036016e+00,  1.72013643e-01, -1.34210920e-01,
        1.12071336e+00,  9.50450483e-01, -7.61575631e-01,  4.40024048e-01,
       -9.66861101e-01, -7.07152865e-01, -6.65705679e-01, -1.68187090e+00,
        2.14943775e-01,  8.46452858e-01, -3.82038733e-01,  3.74520396e-01,
        9.92466860e-01, -9.96039421e-01, -5.61242696e-01, -1.36204185e+00,
       -9.23310139e-01, -2.74715005e-01, -7.18117615e-01, -1.61224089e+00,
        1.81199809e+00,  6.84348544e-01,  1.32024725e-02,  6.39573490e-01,
        7.63118243e-01,  6.18102121e-01,  2.50343318e-01,  3.11495739e-01,
       -8.85954991e-01, -4.69890443e-01, -3.00102067e-01,  1.48711452e+00,
       -1.49193737e+00, -7.43784489e-03, -3.35717754e-01, -1.31045167e+00,
        4.98570778e-01, -8.24254933e-02,  5.48541766e-01, -7.85985380e-01,
        3.59668163e-01,  1.77650008e-01,  1.51901416e+00,  1.35443463e+00,
        5.89076413e-01, -5.78294068e-01,  1.91890523e+00,  1.40180034e+00,
        1.35340450e+00, -1.13345138e+00, -2.79097973e-01, -6.95333076e-01,
        1.86304631e+00, -8.92048077e-01,  6.57202853e-02, -4.76912105e-01,
        7.30498657e-01, -5.75153766e-01,  3.70342700e-01,  8.31542152e-01,
        1.25400336e+00, -4.97110577e-01,  1.15038244e+00, -1.51223331e-01,
       -6.61909362e-01, -5.32868366e-01,  1.41224384e+00, -8.01328918e-01,
       -1.30296720e+00,  6.07917957e-01,  5.53257354e-01, -1.11018014e+00,
        1.03294953e+00,  4.55997527e-01,  3.80494079e-01, -6.71448672e-01,
        2.13749819e+00,  2.80756240e-01, -2.95781621e+00, -8.56247033e-02,
        5.66209111e-01,  6.39891486e-02,  5.05631488e-01, -6.24456337e-01,
        1.33928606e+00,  6.32394522e-01, -3.90943406e-01,  1.35041812e+00,
       -3.44027393e-02, -7.32790347e-01, -1.98317544e-01,  9.30415198e-01,
       -1.69229866e+00,  1.59793060e+00,  7.15400783e-01, -2.04315375e+00,
       -4.73499971e-01, -2.53360529e-02,  1.52698652e+00,  4.02496818e-01,
        7.40558466e-01,  1.79579635e-01, -1.17669662e+00,  9.91908568e-01,
       -1.91639844e-01,  7.98925646e-01, -4.12108113e-01, -1.89852235e+00,
        7.85991372e-02,  1.50899473e+00, -2.76238413e-01, -7.25929194e-01,
       -7.62466191e-01, -8.56647358e-02, -1.47903894e+00, -1.76033211e+00,
       -1.68665073e-01,  9.69375690e-01,  1.64333385e+00,  1.07265562e+00,
        7.75195758e-01, -6.51841357e-01,  1.29783026e+00, -1.57948361e+00,
       -4.18827873e-01,  5.00603913e-01, -1.15256183e-02, -4.33768316e-01,
       -6.68071919e-02, -2.77233518e-01,  7.63462815e-01, -1.84217718e+00,
        1.15087560e+00, -4.58199454e-01, -1.89230057e-01,  1.30886296e+00,
       -2.51351314e-03, -6.16208882e-01, -8.28419880e-01, -1.00871133e+00,
        4.11268563e-01, -1.11539229e+00,  1.68414598e+00, -1.62982087e+00,
        1.41960066e+00,  2.94798650e-01,  3.77899812e-01,  1.22995048e-01,
       -8.73694549e-01,  6.05283057e-01, -1.04635211e+00, -9.35373824e-01,
        6.34863204e-01,  1.32690683e+00, -7.00719432e-01,  8.18293257e-02,
        1.10304551e+00, -2.17218168e+00,  2.57508231e-01, -5.15641088e-01,
        5.15807884e-01,  2.62972856e-01,  1.48313629e+00,  1.62427916e+00,
       -1.39946176e+00, -9.23851387e-01, -5.25091336e-01, -1.59708965e-03,
        4.39869660e-01, -1.46756856e+00, -1.62624245e+00,  6.42825554e-01,
       -1.64427466e+00,  1.20557798e+00,  1.35291152e-01, -7.98761935e-01,
       -5.01888139e-02, -8.69886121e-01, -8.41506886e-01, -1.88928511e+00,
        9.26906966e-01, -6.34719973e-01,  1.39578587e-01, -5.49759174e-01,
        1.15904860e+00, -8.60274743e-01, -1.40549672e+00, -3.73805511e-01,
        1.44436012e+00, -1.24875158e+00,  1.67562217e-01,  7.54151066e-02,
        5.78882911e-01, -1.51299001e+00, -2.19189240e-01, -1.63588732e+00,
        1.48696918e-01, -1.85585107e-01, -4.42095393e-01,  1.06096236e+00,
        5.80655200e-01,  2.33163432e-01,  3.33350938e-01,  1.05770758e+00,
       -4.19925356e-01, -1.37481217e-01, -1.08583726e-01,  9.13545246e-01,
       -5.44792619e-01,  1.85599058e-01,  3.84188333e-01, -5.66341105e-01,
        1.18477544e-01,  2.90183441e-01,  3.36695548e-01,  7.74338812e-01,
       -5.15479077e-01,  8.92533462e-01,  1.08618049e+00, -6.15459371e-01,
       -6.65059865e-01,  2.17104182e+00, -1.22018846e+00,  1.66104914e+00,
       -9.13780279e-01,  5.53855528e-01, -5.18203365e-01, -1.89756430e+00,
       -4.40970102e-01, -8.47071316e-01,  4.44392385e-01, -4.58111989e-01,
       -7.81115892e-01, -2.33461737e+00,  7.49090401e-01,  1.37893254e+00,
        4.30213345e-01,  1.85782053e-01,  3.57992427e-01, -1.10652193e+00,
        9.17284203e-01, -2.09829889e-02, -1.66062982e+00,  4.09506187e-01,
       -1.01543618e+00,  4.99241464e-01, -5.53221567e-01,  3.65242920e-01,
        6.39312694e-01, -1.01259194e+00,  3.87386476e-01,  1.65022134e+00,
        7.39496996e-01, -1.42360330e+00,  1.66614949e+00,  4.68678989e-01,
       -5.12203823e-02,  2.47513006e+00,  5.23074523e-01, -3.90184370e-01,
       -1.83949361e+00, -1.36884583e+00, -4.67033094e-01,  8.54861133e-01,
        8.97796179e-01,  1.91428862e-02, -7.10979780e-01,  3.98134828e-01,
        1.20558103e-02,  1.28450458e+00,  3.61755014e-01,  4.24760320e-01,
       -1.34993432e+00,  5.04939373e-01,  1.58105545e+00,  4.95175047e-01,
        5.16794834e-01, -1.53362606e-01,  1.94597950e+00, -1.23582792e+00,
       -3.13046961e-01, -1.58100361e+00,  1.88940640e-01, -4.46268906e-01,
       -7.73342735e-01,  8.66734394e-01,  1.40648883e-01,  9.72126070e-01,
        2.11112355e+00, -6.41591578e-01,  4.67186439e-01, -9.61714565e-02,
       -4.77908067e-01,  1.69288370e+00,  1.15580138e+00, -1.32975484e+00,
        6.71537223e-01, -1.08149098e+00, -2.75346458e-01, -8.00201701e-01])

In [103]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [104]:
cats

[(0.679, 3.874], (-2.959, -0.672], (-2.959, -0.672], (0.679, 3.874], (-2.959, -0.672], ..., (-2.959, -0.672], (-0.00206, 0.679], (-2.959, -0.672], (-0.672, -0.00206], (-2.959, -0.672]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.959, -0.672] < (-0.672, -0.00206] < (-0.00206, 0.679] < (0.679, 3.874]]

In [105]:
pd.value_counts(cats)

(-2.959, -0.672]      250
(-0.672, -0.00206]    250
(-0.00206, 0.679]     250
(0.679, 3.874]        250
dtype: int64

In [106]:
 pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.00206, 1.309], (-2.959, -1.342], (-1.342, -0.00206], (-0.00206, 1.309], (-1.342, -0.00206], ..., (-1.342, -0.00206], (-0.00206, 1.309], (-1.342, -0.00206], (-1.342, -0.00206], (-1.342, -0.00206]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.959, -1.342] < (-1.342, -0.00206] < (-0.00206, 1.309] < (1.309, 3.874]]

# Detecting and Filtering Outliers

In [107]:
data = pd.DataFrame(np.random.randn(100000, 4))

In [108]:
data

              0         1         2         3
0     -0.160061  1.404478  0.978883 -0.440016
1     -0.347135  1.719161  0.078255  0.535098
2     -1.022553 -1.064268  1.629056  1.150691
3      0.630043  0.778812  0.064545  0.746731
4     -1.059600  0.064716 -0.504495  1.080977
...         ...       ...       ...       ...
99995 -0.236211  0.438461  1.380419 -1.073115
99996  0.152336  0.457063  0.154895  0.524572
99997 -0.498483 -0.376171  1.194941 -0.768075
99998  1.773226  0.603783  0.952556 -0.810382
99999 -2.395380 -1.083290 -1.203699  0.169762

[100000 rows x 4 columns]

In [109]:
data.describe()

                   0              1              2              3
count  100000.000000  100000.000000  100000.000000  100000.000000
mean        0.000222      -0.000568       0.002125      -0.004389
std         1.001006       0.999267       0.999820       0.994917
min        -5.202764      -4.296401      -4.527688      -4.484930
25%        -0.672146      -0.676370      -0.672625      -0.674620
50%         0.001731      -0.002524       0.003122      -0.005468
75%         0.671219       0.675581       0.682709       0.659028
max         4.695471       4.367343       4.652087       4.331254

In [110]:
col = np.absolute(data[2]>3)

In [111]:
pd.value_counts(col)

False    99876
True       124
Name: 2, dtype: int64

In [112]:
data[(np.abs(data)> 3).any(1)]

              0         1         2         3
8     -0.485268 -3.024037  0.482273 -0.579870
121    2.072171  0.452537  3.018800 -0.873547
440    3.050922 -0.223032 -2.148645 -1.629206
510    0.917817 -1.023041  1.853264  3.328679
602   -1.158012  3.072665  0.835601 -0.527526
...         ...       ...       ...       ...
99515  1.638075  3.193397  0.923503 -0.079581
99821 -0.332676  0.323949 -3.917964  0.915618
99936  0.156628 -1.192386  0.572698  3.315886
99940 -0.596076  0.759175 -3.152327 -1.102234
99962  3.212819  0.808450 -2.650903 -1.619948

[1106 rows x 4 columns]

In [113]:
data.head()

          0         1         2         3
0 -0.160061  1.404478  0.978883 -0.440016
1 -0.347135  1.719161  0.078255  0.535098
2 -1.022553 -1.064268  1.629056  1.150691
3  0.630043  0.778812  0.064545  0.746731
4 -1.059600  0.064716 -0.504495  1.080977

In [114]:
np.sign(data)

         0    1    2    3
0     -1.0  1.0  1.0 -1.0
1     -1.0  1.0  1.0  1.0
2     -1.0 -1.0  1.0  1.0
3      1.0  1.0  1.0  1.0
4     -1.0  1.0 -1.0  1.0
...    ...  ...  ...  ...
99995 -1.0  1.0  1.0 -1.0
99996  1.0  1.0  1.0  1.0
99997 -1.0 -1.0  1.0 -1.0
99998  1.0  1.0  1.0 -1.0
99999 -1.0 -1.0 -1.0  1.0

[100000 rows x 4 columns]

In [115]:
data[np.abs(data) > 3]

        0   1   2   3
0     NaN NaN NaN NaN
1     NaN NaN NaN NaN
2     NaN NaN NaN NaN
3     NaN NaN NaN NaN
4     NaN NaN NaN NaN
...    ..  ..  ..  ..
99995 NaN NaN NaN NaN
99996 NaN NaN NaN NaN
99997 NaN NaN NaN NaN
99998 NaN NaN NaN NaN
99999 NaN NaN NaN NaN

[100000 rows x 4 columns]

In [116]:
data[np.abs(data) > 3 ] = np.sign(data) * 3

In [117]:
data.describe()

                   0              1              2              3
count  100000.000000  100000.000000  100000.000000  100000.000000
mean        0.000139      -0.000570       0.002146      -0.004474
std         0.998326       0.996697       0.997276       0.992271
min        -3.000000      -3.000000      -3.000000      -3.000000
25%        -0.672146      -0.676370      -0.672625      -0.674620
50%         0.001731      -0.002524       0.003122      -0.005468
75%         0.671219       0.675581       0.682709       0.659028
max         3.000000       3.000000       3.000000       3.000000

In [118]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1 -1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4 -1.0  1.0 -1.0  1.0

# Permutation and Random Sampling

In [119]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [120]:
sample = np.random.permutation(5)

In [121]:
sample

array([1, 3, 4, 2, 0])

In [122]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [123]:
df.take(sample)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [124]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [125]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

# Computing Indicator/Dummy Variables

In [126]:
#encodes the data

In [127]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
.....: 'data1': range(6)})

In [128]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [129]:
pd.get_dummies(df['data1'])

   0  1  2  3  4  5
0  1  0  0  0  0  0
1  0  1  0  0  0  0
2  0  0  1  0  0  0
3  0  0  0  1  0  0
4  0  0  0  0  1  0
5  0  0  0  0  0  1

In [130]:
s = pd.Series(list('abca'))

In [131]:
pd.get_dummies(s)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

In [132]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [133]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [134]:
df['data1']

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64

In [135]:
df_with_dummy = df[['data1']].join(dummies)

In [136]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [137]:
(np.random.seed(12345))

In [138]:
values = np.random.rand(10)

In [139]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [140]:
 pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [141]:
pd.get_dummies(values)

,0.183919,0.204560,0.316376,0.567725,0.595545,0.653177,0.653570,0.748907,0.929616,0.964515
0,0,0,0,0,0,0,0,0,1,0
1,0,0,1,0,0,0,0,0,0,0
2,1,0,0,0,0,0,0,0,0,0
3,0,1,0,0,0,0,0,0,0,0
4,0,0,0,1,0,0,0,0,0,0
5,0,0,0,0,1,0,0,0,0,0
6,0,0,0,0,0,0,0,0,0,1
7,0,0,0,0,0,1,0,0,0,0
8,0,0,0,0,0,0,0,1,0,0
9,0,0,0,0,0,0,1,0,0,0

#  String Manipulation

In [143]:
val = 'a,b, guido'
val

'a,b, guido'

In [144]:
val.split(',')

['a', 'b', ' guido']

In [147]:
pieces = [x.strip() for x in val.split(',')]

In [148]:
pieces

['a', 'b', 'guido']

In [149]:
first, second, thrid = pieces

In [150]:
first

'a'

In [151]:
'::' .join(pieces)

'a::b::guido'

In [152]:
''.join(pieces)

'abguido'

In [153]:
'guido' in val

True

In [154]:
val.index(',')

1

In [155]:
val.index('a')

0

In [156]:
val.find(':')

-1

In [157]:
val.count(',')

2

In [158]:
val.replace(',', '::')

'a::b:: guido'

In [159]:
val.replace(',', '')

'ab guido'

In [160]:
val.endswith('guido')

True

In [161]:
import re

In [162]:
text = "foo bar\t baz \tqux"

In [163]:
text

'foo bar\t baz \tqux'

In [164]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [165]:
#compile regex manually
regex = re.compile('\s+')

In [166]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [167]:
regex.findall(text)

[' ', '\t ', ' \t']

# Vectorized String Functions in pandas

In [2]:
 data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
.....: 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [3]:
data = pd.Series(data)

In [4]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [5]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [6]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object